# Installing and Using `SQL` in Python
* NOTE: Some queries in python sqlite varied from typical operations: `OR`,`DESC`
* https://www.sqlite.org/cli.html
* https://www.python-course.eu/sql_python.php


## 1. Import `sqlite` and create connection to database
* To use a database, first create connection object to represents the database. 
* The argument of connection ("examples.db") functions both as the name of the file, where the data will be stored, and the name of the database. 
* If a file with this name exists (SQLite database file) it will be opened, but the file does not have to exist.:

In [1]:
import sqlite3 as sqlt
connection = sqlt.connect("examples.db")
cursor = connection.cursor()

## 1.1 Call the cursor() method of connection. 
Generally, a cursor in SQL and databases is a control structure to traverse over the records in a database and returning results. 
* An arbitrary number of cursors can be created. 
* The cursor raverses the records from the result set. 
* SQL command is defined with a triple quoted string in Python:

In [2]:
# Drop the table, if it already exists in examples.db 
cursor.execute("DROP TABLE family_members;")

# 2. Create a Table with Attributes, execute command

In [3]:
sql_command = """
CREATE TABLE family_members ( 
id INTEGER PRIMARY KEY, 
name VARCHAR(10), 
gender VARCHAR(10), 
species VARCHAR(10), 
num_books_read CHAR(3), 
favorite_book VARCHAR(20) );"""

cursor.execute(sql_command)

## 2.1 Use 'INSERT' command to populate the table. 
* Again using the execute method, adding single rows one at a time...
* To run the program you will either have to remove the file company.db or uncomment the "DROP TABLE" line in the SQL command:

In [ ]:
# To insert rows one at a time:

#sql_command = """INSERT INTO family_members (id, name, gender, species, num_books_read)
#    VALUES (1, 'Dave', 'male', 'human', 200);"""
#cursor.execute(sql_command)

#sql_command = """INSERT INTO family_members (id, name, gender, species, num_books_read)
#    VALUES (2, 'Mary', 'female', 'human', 180);"""
#cursor.execute(sql_command)

# Run the COMMIT command to save changes:
#connection.commit()

#connection.close()

## 2.2 Use data from dict or list as input to insert statement. 
* A list with data of persons to be used in the INSERT statement:

In [4]:
fam_data = [ (1, 'Dave', 'male', 'human', 200, 'To Kill a Mockingbird'),
               (2, 'Mary', 'female', 'human', 180, 'Gone with the Wind'),
               (3, 'Pickles', 'male', 'dog', 0, '') ]
               
for p in fam_data:
    format_str = """INSERT INTO family_members (id, name, gender, species, num_books_read, favorite_book)
    VALUES (NULL, '{name}', '{gender}', '{species}', '{num_books_read}', '{favorite_book}' );"""

    sql_command = format_str.format(id=p[0],name=p[1],gender=p[2],species=p[3],num_books_read=p[4],favorite_book=p[5])
    cursor.execute(sql_command)

## Examples and Exercises from SQL Teaching
https://www.sqlteaching.com/#!select

# 3. Use SELECT command to query sql table
* Asteryx selects all columns from table: `SELECT * FROM family_members`
* First, iterating over, selecting all columns and all rows,

In [5]:
cursor.execute("SELECT * FROM family_members;")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
(1, 'Dave', 'male', 'human', '200', 'To Kill a Mockingbird')
(2, 'Mary', 'female', 'human', '180', 'Gone with the Wind')
(3, 'Pickles', 'male', 'dog', '0', '')

## 3.1 Select specific Columns in query

In [6]:
cursor.execute("SELECT name, num_books_read FROM family_members") 
result = cursor.fetchall() 
for r in result:
    print(r)

('Dave', '200')
('Mary', '180')
('Pickles', '0')

# 4. Use WHERE keyword to select rows by given feature

In [7]:
cursor.execute("SELECT * FROM family_members WHERE species = 'dog'") 
res = cursor.fetchone() 
print(res)

(3, 'Pickles', 'male', 'dog', '0', '')

## 4.1 Use Boolean with WHERE command to select rows

In [8]:
cursor.execute("SELECT * FROM family_members WHERE num_books_read > 0") 
result = cursor.fetchall() 
for r in result:
    print(r)

(1, 'Dave', 'male', 'human', '200', 'To Kill a Mockingbird')
(2, 'Mary', 'female', 'human', '180', 'Gone with the Wind')

## 4.2 Return all rows where num_books_read is greater or equal to 180?
SQL accepts various inequality symbols, including: 
* "greater than" `>` 
* "greater than or equal to" `>=` 
* "less than" `<` 
* "less than or equal to" `<=`

In [9]:
cursor.execute("SELECT * FROM family_members WHERE num_books_read >= 180") 
result = cursor.fetchall() 
for r in result:
    print(r)

(1, 'Dave', 'male', 'human', '200', 'To Kill a Mockingbird')
(2, 'Mary', 'female', 'human', '180', 'Gone with the Wind')

# 5. Use AND / OR keywords to query by multiple attributes
* Create new table, and populate from list
* Create compound query with two search criteria
* Return entries  in height and are cats

In [ ]:
# Drop the table, if it already exists in examples.db 
#cursor.execute("""DROP TABLE friends_of_pickles;""")

In [10]:
sql_command = """
CREATE TABLE friends_of_pickles ( 
id INTEGER PRIMARY KEY, 
name VARCHAR(10), 
gender VARCHAR(10), 
species VARCHAR(10), 
height_cm CHAR(5) );"""

cursor.execute(sql_command)

fam_data = [ (1, 'Dave', 'male', 'human', 180),
             (2, 'Mary', 'female', 'human', 160),
             (3, 'Fry', 'male', 'cat', 30), 
             (3, 'Leela', 'female', 'cat', 25),
             (3, 'Odie', 'male', 'dog', 40),
             (3, 'Jumpy', 'male', 'dog', 35),
             (3, 'Sneakers', 'male', 'dog', 55)]
               
for p in fam_data:
    format_str = """INSERT INTO friends_of_pickles (id, name, gender, species, height_cm)
    VALUES (NULL, '{name}', '{gender}', '{species}', '{height_cm}');"""

    sql_command = format_str.format(id=p[0],name=p[1], gender=p[2], species=p[3], height_cm=p[4])
    cursor.execute(sql_command)

## NOTE: `OR` command did not operate as expected in python sqlite instance

In [11]:
# species='dog' OR height_cm < 50

cursor.execute("SELECT * FROM friends_of_pickles WHERE species='dog'")  
result = cursor.fetchall() 
for r in result:
    print(r)

(5, 'Odie', 'male', 'dog', '40')
(6, 'Jumpy', 'male', 'dog', '35')
(7, 'Sneakers', 'male', 'dog', '55')

In [12]:
cursor.execute("SELECT * FROM friends_of_pickles WHERE species='dog' AND height_cm < 45")
result = cursor.fetchall() 
for r in result:
    print(r)

(5, 'Odie', 'male', 'dog', '40')
(6, 'Jumpy', 'male', 'dog', '35')

# 6. Query with `IN` to subset by rows					
https://www.sqlteaching.com/#!in 
* Use WHERE clause to find rows where a value is in a list of several possible values.
* Following query returns the friends_of_pickles that are either a cat or a human.
`SELECT * FROM friends_of_pickles WHERE species IN ('cat', 'human');` 

## 6.1 Use `NOT IN` to find rows that are not in a list 
* Run query to return rows that are not cats or dogs:

In [13]:
cursor.execute("SELECT * FROM friends_of_pickles WHERE species NOT IN ('cat', 'dog')")  
result = cursor.fetchall() 
for r in result:
    print(r)

(1, 'Dave', 'male', 'human', '180')
(2, 'Mary', 'female', 'human', '160')

# 7. Use DISTINCT with SELECT, to remove duplicates. 
* Following query returns gender/species combinations of animals less than 100cm in height. 
* Even though there are multiple male dogs under that height, one row returns "male" and "dog".

`SELECT DISTINCT gender, species FROM friends_of_pickles WHERE height_cm < 100`

Write a query to return list of distinct species of animals greater than 50cm in height:

`SELECT DISTINCT species FROM friends_of_pickles WHERE height_cm > 50`

In [14]:
cursor.execute("SELECT DISTINCT species FROM friends_of_pickles")  
result = cursor.fetchall() 
for r in result:
    print(r)

('human',)
('cat',)
('dog',)

# 8. Use `ORDER BY` to sort rows by attribute
* To return friends_of_pickles sorted by name, in ascending alphabetical order.

`SELECT * FROM friends_of_pickles ORDER BY name;` 

## 8.1 Add `DESC` at end of query to sort in descending order 
* Following query sorts `friends_of_pickles` by `height_cm` in descending order.
* For some reason the jupyter notebook instance of SQLite is buggy

`SELECT * FROM friends_of_pickles ORDER BY height_cm DESC;`

## Note: Order not maintained in `ORDER BY` command, or `DESC`:

In [15]:
cursor.execute("SELECT * FROM friends_of_pickles ORDER BY height_cm")  
result = cursor.fetchall() 
for r in result:
    print(r)

(2, 'Mary', 'female', 'human', '160')
(1, 'Dave', 'male', 'human', '180')
(4, 'Leela', 'female', 'cat', '25')
(3, 'Fry', 'male', 'cat', '30')
(6, 'Jumpy', 'male', 'dog', '35')
(5, 'Odie', 'male', 'dog', '40')
(7, 'Sneakers', 'male', 'dog', '55')

# 9. Use `LIMIT` to restrict the number rows returned 
* To return a few examples of data in a tables with potentially millions of rows
* Use `LIMIT` to select first few rows with . 
* Use `ORDER BY`, to get first rows for that order. 

`SELECT * FROM friends_of_pickles ORDER BY height_cm LIMIT 2;`

Write a query to return the single row (and all columns) of tallest friends_of_pickles?

### NOTE: Order was not maintained, DESC command did not work as expected.
* Some versions of SQL do NOT use the LIMIT keyword.
* The LIMIT keyword comes after the DESC keyword.

In [16]:
cursor.execute("SELECT * FROM friends_of_pickles ORDER BY height_cm LIMIT 2;")  
result = cursor.fetchall() 
for r in result:
    print(r)

(2, 'Mary', 'female', 'human', '160')
(1, 'Dave', 'male', 'human', '180')

## 10. `COUNT(*)` returns the number of rows in a table
* Querying of a table states_of_us returns 50 rows
* Following query returns total number of rows in table `friends_of_pickles`.

In [17]:
cursor.execute("SELECT COUNT(*) FROM friends_of_pickles;")  
result = cursor.fetchall() 
for r in result:
    print(r)

(7,)

## 10.1 Combine `COUNT(*)` ... `WHERE`
* Query returns the number of rows that match conditions of the WHERE clause.
* Following query return the number of rows in friends_of_pickles where species is dog:

In [18]:
cursor.execute("SELECT COUNT(*) FROM friends_of_pickles WHERE species = 'dog';")  
result = cursor.fetchall() 
for r in result:
    print(r)

(3,)

## 11.1 Simple Operations: `SUM` to add values in a table. 
* Query below returns the total `num_books_read` in the table 'family_members'

In [19]:
cursor.execute("SELECT SUM(num_books_read) FROM family_members")  
result = cursor.fetchall() 
for r in result:
    print(r)

(380,)

## 11.2 Use AVG to find take average of values in a table. 
* Query below returns the average num_books_read made by each family member? 
* Note: Average will not always be exact due to how computers process numbers.

In [20]:
cursor.execute("SELECT AVG(num_books_read) FROM family_members")  
result = cursor.fetchall() 
for r in result:
    print(r)

(126.66666666666667,)

## 11.3 Use MAX and MIN to return maximum or minimum value of a table. 
* Query below return the highest num_books_read that a family member makes

In [21]:
cursor.execute("SELECT MAX(num_books_read) FROM family_members;")  
result = cursor.fetchall() 
for r in result:
    print(r)

('200',)

# 12. Use `GROUP BY` to split the table according to row values
* When you GROUP BY something, you split the table into different piles based on the value of each row. 
* Can use aggregate functions (COUNT, SUM, AVG, MAX, MIN) with `Group By`. 
* Query below returns the number of rows for each species.  

`SELECT COUNT(*), species FROM friends_of_pickles GROUP BY species;` 

### Write a query to return the tallest height for each species, with species name next to the height: 
* Can create compoung query joining multiple keywords

In [22]:
cursor.execute("SELECT species, MAX(height_cm) FROM friends_of_pickles GROUP BY species ORDER BY height_cm;")  
result = cursor.fetchall() 
for r in result:
    print(r)

('human', '180')
('cat', '30')
('dog', '55')

# 13. Nested queries put one SQL query inside another SQL query. 
The query below returns the family members with the least number of legs:
* First, the SELECT query inside parentheses is executed first, and returns the minimum number of legs. 
* Next, that value (2) is used in the outside query, to find all family members that have 2 legs.

`SELECT * FROM family_members WHERE num_legs = (SELECT MIN(num_legs) FROM family_members);` 

Write a query to return the family members that have the highest num_books_read:

In [23]:
cursor.execute("SELECT * FROM family_members WHERE num_books_read = (SELECT MAX(num_books_read) FROM family_members);")  
result = cursor.fetchall() 
for r in result:
    print(r)

(1, 'Dave', 'male', 'human', '200', 'To Kill a Mockingbird')

## 13.1 Dealing with `NULL` values
* Sometimesa given row, there is no value at all for a given column (e.g., no book loving dogs dogs)
* E.g., no value in `favorite_book` column for dogs, which has the value `NULL`. 
* Use `IS NULL` or `IS NOT NULL` to find rows where the value for a column is or is not NULL.

Write query to return all rows of `family_members` where `favorite_book` is not null (!=):

In [25]:
cursor.execute("SELECT * FROM family_members WHERE favorite_book IS NOT null;")  
result = cursor.fetchall() 
for r in result:
    print(r)

(1, 'Dave', 'male', 'human', '200', 'To Kill a Mockingbird')
(2, 'Mary', 'female', 'human', '180', 'Gone with the Wind')
(3, 'Pickles', 'male', 'dog', '0', '')

# 14. Dates and Years
* A table column can contain a date value: `YYYY-MM-DD` 
* first 4 digits represents year, next 2 represents month, and 2 digits represents the day. 
* 1985-07-20 indicates July 20, 1985.

### Create new Table for celebrity birthdates 
* Delete table if it already exists

In [45]:
# Drop the table, if it already exists in examples.db 
cursor.execute("DROP TABLE celebs_born;")

In [46]:
sql_command = """
CREATE TABLE celebs_born ( 
id INTEGER PRIMARY KEY, 
name VARCHAR(10), 
birthdate VARCHAR (10) );"""

cursor.execute(sql_command)

In [47]:
celebs_data = [ (1, 'Hope Sandoval', '1966-06-24'),
               (2, 'Eddy Vedder', '1977-11-11'),
               (3, 'Lady Gaga', '1986-03-28') ]
               
for p in celebs_data:
    format_str = """INSERT INTO celebs_born (id, name, birthdate)
    VALUES (NULL, '{name}', '{birthdate}' );"""

    sql_command = format_str.format(id=p[0],name=p[1],birthdate=p[2])
    cursor.execute(sql_command)

In [48]:
cursor.execute("SELECT * FROM celebs_born;")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
(1, 'Hope Sandoval', '1966-06-24')
(2, 'Eddy Vedder', '1977-11-11')
(3, 'Lady Gaga', '1986-03-28')

# 14.1 Use Boolean operators to compare dates 
* Query below returns a list of celebrities born before August 17th, 1985, using < and >. 

`SELECT * FROM celebs_born WHERE birthdate < '1985-08-17';` 

### Write a query that returns a list of celebrities born after September 1st, 1980:

In [50]:
cursor.execute("SELECT * FROM celebs_born WHERE birthdate > '1975-09-01';")  
result = cursor.fetchall() 
for r in result:
    print(r)

(2, 'Eddy Vedder', '1977-11-11')
(3, 'Lady Gaga', '1986-03-28')

# 15. INNER JOINS
Use `INNER JOIN ... ON` to put together information stored in different tables.

Joining tables gets to the core of SQL functionality, but it can get very complicated. 

Start with simple INNER JOIN with 3 tables:
    * `character`: Each character is a row and is represented by a unique identifier (id), e.g. 1 is Doogie Howser
    * `character_tv_show`: For each character, which show is he/she in?
    * `character_actor`: For each character, who is the actor?

In [72]:
# Drop the table, if it already exists in examples.db 
cursor.execute("DROP TABLE character;")

In [73]:
sql_command = """
CREATE TABLE character ( 
id INTEGER PRIMARY KEY, 
name VARCHAR(20) );"""

cursor.execute(sql_command)

In [74]:
character_data = [ (1, 'Dougie Houser'),
               (2, 'Barney Stinson'),
               (3, 'Lily Aldrin'),
               (4, 'Willow Rosenberg') ]
               
for p in character_data:
    format_str = """INSERT INTO character (id, name)
    VALUES (NULL, '{name}' );"""

    sql_command = format_str.format(id=p[0],name=p[1])
    cursor.execute(sql_command)

### Create Table for `character_tv_show`

In [62]:
# Drop the table, if it already exists in examples.db 
cursor.execute("DROP TABLE character_tv_show;")

In [63]:
sql_command = """
CREATE TABLE character_tv_show ( 
id INTEGER PRIMARY KEY, 
character_id VARCHAR(10), 
tv_show_name VARCHAR(50) );"""

cursor.execute(sql_command)

In [64]:
tv_show_data = [ (1, '4', 'Buffy Vampire Slayer'),
               (2, '3', 'How I Met Your Mother'),
               (3, '2', 'How I Met Your Mother'),
               (4, '1', 'Dougie Houser, M.D.')]
               
for p in tv_show_data:
    format_str = """INSERT INTO character_tv_show (id, character_id, tv_show_name)
    VALUES (NULL, '{character_id}', '{tv_show_name}' );"""

    sql_command = format_str.format(id=p[0],character_id=p[1],tv_show_name=p[2])
    cursor.execute(sql_command)

### Create table for `character_actor`

In [ ]:
# Drop the table, if it already exists in examples.db 
cursor.execute("DROP TABLE character_actor;")

In [66]:
sql_command = """
CREATE TABLE character_actor ( 
id INTEGER PRIMARY KEY, 
character_id VARCHAR(1), 
actor_name VARCHAR(30) );"""

cursor.execute(sql_command)

In [69]:
celebs_data = [ (1, '4', 'Alyson Hannigan'),
               (2, '3', 'Alyson Hannigan'),
               (3, '2', 'Neil Patrick Harris'),
               (4, '1', 'Neil Patrick Harris') ]
               
for p in celebs_data:
    format_str = """INSERT INTO character_actor (id, character_id , actor_name)
    VALUES (NULL, '{character_id}', '{actor_name}' );"""

    sql_command = format_str.format(id=p[0],character_id=p[1],actor_name=p[2])
    cursor.execute(sql_command)

## Three Tables
- character
- character_actor
- character_tv_show

In [75]:
cursor.execute("SELECT * FROM character;")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
(1, 'Dougie Houser')
(2, 'Barney Stinson')
(3, 'Lily Aldrin')
(4, 'Willow Rosenberg')

In [70]:
cursor.execute("SELECT * FROM character_actor;")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
(1, '4', 'Alyson Hannigan')
(2, '3', 'Alyson Hannigan')
(3, '2', 'Neil Patrick Harris')
(4, '1', 'Neil Patrick Harris')

In [65]:
cursor.execute("SELECT * FROM character_tv_show;")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
(1, '4', 'Buffy Vampire Slayer')
(2, '3', 'How I Met Your Mother')
(3, '2', 'How I Met Your Mother')
(4, '1', 'Dougie Houser, M.D.')

## 15.1 Inner joins
See that in `character_tv_show`, instead of storing both the character and TV show names (e.g. Willow Rosenberg and Buffy the Vampire Slayer), it stores the character_id as a substitute for the character name. 

### The character_id refers to the matching id row from the character table. 
* This is done so data is not duplicated. 
* If the name of a character were to change, you would only have to change the name of the character in one row. 
* This allows us to "join" the tables together "on" that reference/common column. 

### The following query returns each character name with his/her TV show name:
* Puts together every row in character with the corresponding row in character_tv_show, or vice versa.
```
SELECT character.name, character_tv_show.tv_show_name
FROM character 
INNER JOIN character_tv_show
ON character.id = character_tv_show.character_id;
```
 

### Note: Use the syntax `table_name.column_name`. 
- If we only used `column_name`, SQL might incorrectly assume which table it is coming from.
- The example query above is written over multiple lines for readability, but that does not affect the query.

In [76]:
cursor.execute("""SELECT character.name, character_tv_show.tv_show_name 
               FROM character INNER JOIN character_tv_show
               ON character.id = character_tv_show.character_id;""")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
('Willow Rosenberg', 'Buffy Vampire Slayer')
('Lily Aldrin', 'How I Met Your Mother')
('Barney Stinson', 'How I Met Your Mother')
('Dougie Houser', 'Dougie Houser, M.D.')

### Write a query for an inner join to pair each character name with the actor who plays them: 
* Select the columns: character.name, character_actor.actor_name

In [77]:
cursor.execute("""SELECT character.name, character_actor.actor_name FROM character 
                INNER JOIN character_actor ON character.id = character_actor.character_id;""")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

fetchall:
('Willow Rosenberg', 'Alyson Hannigan')
('Lily Aldrin', 'Alyson Hannigan')
('Barney Stinson', 'Neil Patrick Harris')
('Dougie Houser', 'Neil Patrick Harris')

# 16. MULTIPLE JOINS 		
https://www.sqlteaching.com/#!multiple_joins	

In the previous example the TV show names and actor names were duplicated. To not duplicate any names, we need to have more tables, and use multiple joins. In this case, we have tables to represent objects of entities (e.g., 'characters', 'TV shows', 'actors'), and tables representing the relationship between entities (`character_tv_show`, `character_actor`). 

```
character
id	name
1	Doogie Howser
2	Barney Stinson
3	Lily Aldrin
4	Willow Rosenberg

tv_show
id	name
1	Buffy the Vampire Slayer
2	How I Met Your Mother
3	Doogie Howser, M.D.

character_tv_show
id	character_id	tv_show_id
1	1	            3
2	2	            2
3	3	            2
4	4	            1
```

This is a flexible way of capturing the relationship between different entities, as some TV show characters might be in multiple shows, and some actors are known for playing multiple characters. The following query returns each character name with his/her TV show name, we can write

```
SELECT character.name, tv_show.name FROM character 
INNER JOIN character_tv_show ON character.id = character_tv_show.character_id
INNER JOIN tv_show ON character_tv_show.tv_show_id = tv_show.id;
```

### Use two joins to pair each character name with the actor who plays them 
Select the columns: character.name, actor.name

```
character   
id   name
1    Doogie Howser
2    Barney Stinson
3    Lily Aldrin
4    Willow Rosenberg

actor
id   name
1    Alyson Hannigan
2    Neil Patrick Harris

character_actor
id   character_id  actor_id
1    1             2
2    2             2
3    3             1
4    4             1

SELECT character.name, actor.name 
FROM character
INNER JOIN character_actor 
ON character.id = character_actor.character_id
INNER JOIN actor
ON character_actor.actor_id = actor.id;

Result: 
Character        Actor
name             name
Doogie Howser    Neil Patrick Harris
Barney Stinson   Neil Patrick Harris
Lily Aldrin      Alyson Hannigan
Willow Rosenberg Alyson Hannigan
```

In [ ]:
cursor.execute("""SELECT character.name, character_tv_show.tv_show_name 
               FROM character INNER JOIN character_tv_show
               ON character.id = character_tv_show.character_id;""")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("""SELECT character.name, character_tv_show.tv_show_name 
               FROM character INNER JOIN character_tv_show
               ON character.id = character_tv_show.character_id;""")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("""SELECT character.name, character_tv_show.tv_show_name 
               FROM character INNER JOIN character_tv_show
               ON character.id = character_tv_show.character_id;""")
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("SELECT * FROM family_members;")  
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("SELECT * FROM family_members;")  
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("SELECT * FROM family_members;")  
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
cursor.execute("SELECT * FROM family_members;")  
result = cursor.fetchall() 
for r in result:
    print(r)

In [ ]:
### Close the SQLite connection at end of the session
connection.close()

<br>
## Using MySQL in Python
* MySQLdb does not support Python 3 but it is not the only MySQL driver for Python: https://stackoverflow.com/questions/23376103/python-3-4-0-with-mysql-database
* `PyMySQL` is a pure python MySQL driver, which means it is slower, but it does not require a compiled C component or MySQL libraries and header files to be installed on client machines. It has Python 3 support.
* Install pymysql in the terminal shell: `python3 -m pip install pymysql`

import pymysql
import pymysql.cursors

# Connect to database
connection = pmsql.connect (host='localhost',
                            user='root',
                            db = 'examples')

cursor = connection.cursor()
cursor.execute ("SELECT*FROM examples;")

print("cursor.description", cursor.description)
print()
cursor.close()

#connection.close()